from aiogram import types
# from aiogram.filters import Command

async def start_command(message: types.Message, keyboard_main):
    await message.answer(
        'Привет, я — бот-аналитик новостей. Отправь мне тему, и я:\n\n'
        '🔍 Найду топ новостей по теме\n'
        '📝 Сделаю краткую выжимку\n' 
        '📊 Проанализирую тон\n'
        'Выберите действие:',
        reply_markup=keyboard_main
    )

async def help_command(message: types.Message):
    await message.answer(
        'Доступные команды:\n\n' 
        '/start — приветствие\n' 
        '/help — помощь\n' 
        '/top_news — топ новостей\n' 
        '/extra — суммаризация и анализ тональности новостей\n\n'
        'Бот умеет искать новости на различные темы. Достаточно просто написать интересующий топик на русском языке. После этого вы сможете получить топ-новостей со ссылками на источники или их краткую выжимку с анализом тональности.\n\n' 
        'Попробуйте переформулировать тему, если бот не найдет то, что вы ищете'
    )

async def top_news_request(message: types.Message):
    return "top_news"

async def extra_request(message: types.Message):
    return "extra"